[
    {
        "id": 1,
        "title": "Essential Tech Skills to Future-Proof Your Career in 2025",
        "image": "https://i.ibb.co/Rwhb6tS/businessman-using-tablet-with-digital-data-interface.jpg",
        "author": "Innovation Insights",
        "date": "January 5th 2025",
        "description": "As technology continues to evolve, keeping your skills updated is more important than ever. This article highlights the most critical technical and soft skills for 2025, including cybersecurity, machine learning, and emotional intelligence. Learn how to stay competitive in a dynamic job market.",
        "content": "Explore the must-have tech skills for 2025 and how to start building them today to stay ahead in your career."
    },
    {
        "id": 2,
        "title": "Crafting a Winning Resume for Today’s Job Market",
        "image": "https://i.ibb.co/Tx5shNrq/recruitment-consulting-venn-diagram.jpg",
        "author": "Job Prep Studio",
        "date": "January 12th 2025",
        "description": "Creating a resume that stands out in 2025 requires more than listing your past roles. Discover how to structure your resume effectively, tailor it for specific job descriptions, and make it ATS-friendly. Packed with real examples and modern design tips.",
        "content": "Master the techniques to write an effective resume that gets noticed by both hiring managers and applicant tracking systems."
    },
    {
        "id": 3,
        "title": "Remote Work in 2025: What Professionals Need to Know",
        "image": "https://i.ibb.co/TB6Cs2Pn/portrait-young-man-work-video-call-with-laptop-from-home-home-office-concept-new-normal-lifestyle.jpg",
        "author": "Digital Workforce Weekly",
        "date": "February 2nd 2025",
        "description": "With remote work now a staple in many industries, understanding the latest trends is essential. This article covers everything from asynchronous workflows to cross-timezone collaboration and mental wellness in remote environments.",
        "content": "Get up-to-date on the current and emerging trends in remote work that are reshaping modern career paths."
    },
    {
        "id": 4,
        "title": "5 Programming Languages You Can’t Ignore in 2025",
        "image": "https://i.ibb.co/1fVMSfzp/programming-background-collage.jpg",
        "author": "Code Trends Today",
        "date": "February 10th 2025",
        "description": "Choosing the right programming language can define your career. We break down the top languages to learn in 2025—such as TypeScript, Kotlin, and Julia—and why they matter in areas like mobile apps, AI, and data science.",
        "content": "Learn which programming languages are leading the tech space in 2025 and how to start mastering them."
    },
    {
        "id": 5,
        "title": "Build Real Connections: Smart Networking Strategies for 2025",
        "image": "https://i.ibb.co/rK6R87Qw/hand-button-man-multimedia-mail.jpg",
        "author": "Career Growth Network",
        "date": "February 18th 2025",
        "description": "Networking is more than exchanging business cards—it’s about building authentic relationships. Learn modern networking tips using digital platforms, discover how to connect with mentors, and make the most of industry events and virtual communities.",
        "content": "Unlock powerful networking tactics that help you build lasting professional relationships in 2025 and beyond."
    }
]
